export const ERROR_MESSAGE = {
  DEFAULT: "에러가 발생했습니다. 관리자에게 문의해주세요.",
  OFFLINE: "인터넷 연결이 불안정 합니다. 네트워크 상태를 확인해주세요.",
  RESPONSE: "서버 요청에 문제가 발생했습니다. 잠시 후에 다시 시도해주세요.",
  API_DEFAULT: "서버 상태에 문제가 발생했습니다. 잠시 후에 다시 시도해주세요.",
  API: {
    9: "서버가 현재 점검 중입니다. 잠시 후에 다시 시도해주세요.",
    11: "서버 상태에 문제가 발생했습니다. TMDB에 문의해주세요.",
    16: "해당 디바이스의 접속이 거절되었습니다.",
    22: "페이지는 최대 1000페이지까지만 조회 가능합니다.",
    24: "요청 시간이 초과되었습니다. 다시 시도해주세요.",
    35: "토큰이 만료되었습니다. 관리자에게 문의해주세요.",
    47: "입력이 잘못 되었습니다. 다시 입력해주세요.",
  },
};
